import React from 'react';
import './App.css';


const tempData = [{
    title: "Чи безпечно отримувати перекази за номером телефону на вашому сайті?",
    description: "Так, сервіс переказів за номером телефону підтримується Mastercard і захищений за стандартом інформаційної безпеки PCI DSS*, тож тут ніхто не може викрасти ваші кошти або інформацію. Крім того, сервіс не запитує у вас секретні дані: CVV- чи CVC-коди, пін-код тощо. Ви вводите на сайті лише номер своєї картки. Цього недостатньо для шахрайства.\n" +
    "\n" + "*Стандарт PCI DSS (Payment Card Industry Data Security Standard) єдиний для усіх компаній, які працюють із секретними даними платіжних карток. Він складається з 12 правил, яких необхідно дотримуватися, щоб повністю убезпечити онлайн-платежі. Сервіс переказів за номером телефону пройшов повноцінну перевірку на дотримання цих правил."
}, {
    title: "Як здійснюється платіж за номером телефону?",
    description: "Коли вам відправляють кошти за номером телефону, сума переказу блокується на картці відправника і знімається з його рахунку лише тоді, коли ви підтверджуєте, що бажаєте отримати переказ на свою картку.\n" +
    "Якщо ви не підтверджуєте отримання переказу, кошти розблоковуються і повертаються відправнику."
}, {
    title: "Чи є комісія за переказ?",
    description: "Якщо ви отримуєте переказ, то не сплачуєте жодної комісії – отримання переказу за номером телефону безкоштовне. Комісію за переказ сплачує відправник."
}, {
    title: "Куди буде зараховано переказ, який я отримав?",
    description: "Переказ зарахується на картку, яку ви вкажете в персональному кабінеті. Ви можете отримувати всі перекази на одну картку або кожен раз обирати іншу.\n" +
    "Зверніть увагу, перекази ніколи не зараховуються на ваш номер телефону.\n" +
    "Якщо спливає строк зберігання переказу, то переказ повертається відправнику."
}, {
    title: "Як швидко я отримаю переказ?",
    description: "Зазвичай перекази зараховуються миттєво, але іноді це займає до 30 хвилин, в залежності від регламентів роботи вашого банку."
}];

const Block = ({id, title, description, className, onClick}) => {
    return (
        <div className="container">
            <h2 id={id} onClick={onClick}>{title}</h2>
            <div className={`description ${className}`}>{description}</div>
        </div>
    )
};

class App extends React.Component {
    state = {
        visible: null
    };

    handleVisibility(event) {
        let currentId = (event.target.id !== this.state.visible) ? event.target.id : null;

        this.setState({
            visible: currentId
        });
    }

    render() {
        return (
            <div className="main">
                <h1>Популярні питання</h1>
                {
                    tempData.map((item, i) =>
                        <Block
                            key={i}
                            id={i}
                            title={item.title}
                            description={item.description}
                            onClick={this.handleVisibility.bind(this)}
                            className={(this.state.visible === i.toString()) ? "visible" : "hidden"}
                        />
                    )
                }
            </div>
        )
    }
}

export default App;